# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on One-to-Many and Many-to-many relationships!

## Objectives

You will be able to:
- Query data including Many-to-Many relationships
- Write queries that make use of Join Tables

## One-to-Many and Many-to-Many Joins
<img src='Database-Schema.png' width=550>

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

(i don't know how to delete this cell)

In [69]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

In [70]:
query = '''
SELECT 
    employees.firstName 
,   employees.lastName 
,   offices.city 
,   offices.state 
,   offices.officeCode
FROM 
    employees 
JOIN offices
    ON employees.officeCode = offices.officeCode
ORDER BY
    employees.firstName 
,   employees.lastName 
'''

In [71]:
result = cur.execute(query)

In [72]:
result.description

(('firstName', None, None, None, None, None, None),
 ('lastName', None, None, None, None, None, None),
 ('city', None, None, None, None, None, None),
 ('state', None, None, None, None, None, None),
 ('officeCode', None, None, None, None, None, None))

In [73]:
columns = [row[0] for row in result.description]
columns

['firstName', 'lastName', 'city', 'state', 'officeCode']

(i don't know how to delete this cell')

In [11]:
next(result)

('Diane', 'Murphy', 'San Francisco', 'CA', '1')

In [12]:
next(result)

('Mary', 'Patterson', 'San Francisco', 'CA', '1')

In [74]:
result_data = list(result)
result_data

#is the same as:
# result_data = []
# for row in result:
#     result_data.append(row)

# #is the same as:
# result_data = []
# while True:
#     try:
#         row = next(result)
#         result_data.append(row)
#     except StopIteration:
#         break

[('Andy', 'Fixter', 'Sydney', '', '6'),
 ('Anthony', 'Bow', 'San Francisco', 'CA', '1'),
 ('Barry', 'Jones', 'London', '', '7'),
 ('Diane', 'Murphy', 'San Francisco', 'CA', '1'),
 ('Foon Yue', 'Tseng', 'NYC', 'NY', '3'),
 ('George', 'Vanauf', 'NYC', 'NY', '3'),
 ('Gerard', 'Bondur', 'Paris', '', '4'),
 ('Gerard', 'Hernandez', 'Paris', '', '4'),
 ('Jeff', 'Firrelli', 'San Francisco', 'CA', '1'),
 ('Julie', 'Firrelli', 'Boston', 'MA', '2'),
 ('Larry', 'Bott', 'London', '', '7'),
 ('Leslie', 'Jennings', 'San Francisco', 'CA', '1'),
 ('Leslie', 'Thompson', 'San Francisco', 'CA', '1'),
 ('Loui', 'Bondur', 'Paris', '', '4'),
 ('Mami', 'Nishi', 'Tokyo', 'Chiyoda-Ku', '5'),
 ('Martin', 'Gerard', 'Paris', '', '4'),
 ('Mary', 'Patterson', 'San Francisco', 'CA', '1'),
 ('Pamela', 'Castillo', 'Paris', '', '4'),
 ('Peter', 'Marsh', 'Sydney', '', '6'),
 ('Steve', 'Patterson', 'Boston', 'MA', '2'),
 ('Tom', 'King', 'Sydney', '', '6'),
 ('William', 'Patterson', 'Sydney', '', '6'),
 ('Yoshimi', 'Kato', 'Tokyo', 'Chiyoda-Ku', '5')]

In [24]:
len(result_data)

23

In [78]:
pd.DataFrame(result_data, columns=columns).head()

  firstName lastName           city state officeCode
0      Andy   Fixter         Sydney                6
1   Anthony      Bow  San Francisco    CA          1
2     Barry    Jones         London                7
3     Diane   Murphy  San Francisco    CA          1
4  Foon Yue    Tseng            NYC    NY          3

In [36]:
g = iter(range(0, 100))

In [38]:
next(g)

1

In [41]:
def py2_range(start, stop):
    '''Return list of all integers between start and stop'''
    result = []
    i = start
    while i < stop:
        result.append(i)
        i += 1
    return result
py2_range(0,10)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [42]:
for i in range (0, 10):
    print (i)

0
1
2
3
4
5
6
7
8
9

In [44]:
def py3_range (start, stop):
    '''Yield a list of all integers between start and stop.'''
    i = start
    while i < stop:
        yield i 
        i += 1
py3_range(0,10)

In [45]:
list(py3_range(0,10))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

## Customers and their Orders (a One-to-Many join)

Return a list of all of the customers. For each customer return a record for each of their order numbers, order dates and statuses.

In [2]:
query = '''



'''

# Your code here

## Orders and their Order Details (another One-to-Many join)

Return a list of orders. For each order return a record for each order detail within the order.

In [3]:
# Your code here

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of the orders with the the order information, and all the product information for each product in the order.

In [4]:
# Your code here

## Summary

In this lab, you practiced your knowledge on One-to-Many and Many-to-many relationships!